export const AccordionData = [
  {
    title: "Виртуальный адрес в Великобритании",
    question:
      "Что делать, если Вы забыли внести трек номер на сайт, а заказ уже пришел?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Как я узнаю что заказ пришел на склад?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Покупки на Eбeй / Ebay",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Как купить на виртуальный адрес?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Сколько стоит виртуальный адрес?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Как купить на виртуальный адрес?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Анонс скидочныx купонов и промкодов",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Как узнать пришел ли заказ полностью?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Как узнать что заказ пришел на склад?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
  {
    question: "Что такое выкуп в компашке?",
    answer:
      "Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. От всех деревни алфавит великий грустный вдали, точках гор которой, заманивший, текста одна она текстов текстами строчка снова вопрос переулка меня ему путь свой! Дорогу путь эта взобравшись заголовок толку буквоград.",
  },
];
