import './app.scss'

import Page1 from './pages/page1/page1'
import Page3 from './pages/page3/page3'
import {Routes,Route,Link} from 'react-router-dom'

// import Change from './pages/change/change'

function App() {
  return (
    <div className='container'>
      <header>
        <input type="checkbox" id='check' />
        <div className='img'>
          <Link to='/'>
          <img src="./assets/logo/logo.png" alt="" />
          </Link>
        </div>
        <nav className='navbar'>
          <label for="check" className='burger'>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M16.172 11l-5.364-5.364 1.414-1.414L20 12l-7.778 7.778-1.414-1.414L16.172 13H4v-2z" /></svg>
          </label>
          <ul>
            <li>
              <Link to="/">Как покупать</Link>
            </li>
            <li>
              <Link to="">Распродажи</Link>
            </li>
            <li>
              <Link to="/discount">Цены</Link>
            </li>
            <li>
              <a href="#">Помощь</a>
            </li>
            <li>
              <a href="#">Бонусы</a>
            </li>
            <li>
              <a href="#">Блог</a>
            </li>
            <li>
              <a href="#">Магазины</a>
            </li>
          </ul>
          <button >
            Связаться с нами
          </button>
        </nav>
        <div className='signUp'>
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M4 22a8 8 0 1 1 16 0h-2a6 6 0 1 0-12 0H4zm8-9c-3.315 0-6-2.685-6-6s2.685-6 6-6 6 2.685 6 6-2.685 6-6 6zm0-2c2.21 0 4-1.79 4-4s-1.79-4-4-4-4 1.79-4 4 1.79 4 4 4z" /></svg>
          <p>
            Вход
          </p>
        </div>
        <button >
          Связаться с нами
        </button>
        <label for="check" className='burger'>
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M3 4h18v2H3V4zm6 7h12v2H9v-2zm-6 7h18v2H3v-2z" /></svg>
        </label>
      </header>
     
    <Routes>
      <Route path='/' element={<Page1/>}/>
      <Route path='/discount' element={<Page3 />}/>

    </Routes>
      

      <footer className='footer'>
        <div className='footer_item_1'>
          <Link to="/">
          <img src="./assets/logo/logo.png" alt="" />
          </Link>
          <div className='footer_item_1-contact'>
            <div className='contact-icon'>
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M7.253 18.494l.724.423A7.953 7.953 0 0 0 12 20a8 8 0 1 0-8-8c0 1.436.377 2.813 1.084 4.024l.422.724-.653 2.401 2.4-.655zM2.004 22l1.352-4.968A9.954 9.954 0 0 1 2 12C2 6.477 6.477 2 12 2s10 4.477 10 10-4.477 10-10 10a9.954 9.954 0 0 1-5.03-1.355L2.004 22zM8.391 7.308c.134-.01.269-.01.403-.004.054.004.108.01.162.016.159.018.334.115.393.249.298.676.588 1.357.868 2.04.062.152.025.347-.093.537a4.38 4.38 0 0 1-.263.372c-.113.145-.356.411-.356.411s-.099.118-.061.265c.014.056.06.137.102.205l.059.095c.256.427.6.86 1.02 1.268.12.116.237.235.363.346.468.413.998.75 1.57 1l.005.002c.085.037.128.057.252.11.062.026.126.049.191.066a.35.35 0 0 0 .367-.13c.724-.877.79-.934.796-.934v.002a.482.482 0 0 1 .378-.127c.06.004.121.015.177.04.531.243 1.4.622 1.4.622l.582.261c.098.047.187.158.19.265.004.067.01.175-.013.373-.032.259-.11.57-.188.733a1.155 1.155 0 0 1-.21.302 2.378 2.378 0 0 1-.33.288 3.71 3.71 0 0 1-.125.09 5.024 5.024 0 0 1-.383.22 1.99 1.99 0 0 1-.833.23c-.185.01-.37.024-.556.014-.008 0-.568-.087-.568-.087a9.448 9.448 0 0 1-3.84-2.046c-.226-.199-.435-.413-.649-.626-.89-.885-1.562-1.84-1.97-2.742A3.47 3.47 0 0 1 6.9 9.62a2.729 2.729 0 0 1 .564-1.68c.073-.094.142-.192.261-.305.127-.12.207-.184.294-.228a.961.961 0 0 1 .371-.1z" /></svg>
            </div>
            <div className='contact-icon'>
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M7.253 18.494l.724.423A7.953 7.953 0 0 0 12 20a8 8 0 1 0-8-8c0 1.436.377 2.813 1.084 4.024l.422.724-.653 2.401 2.4-.655zM2.004 22l1.352-4.968A9.954 9.954 0 0 1 2 12C2 6.477 6.477 2 12 2s10 4.477 10 10-4.477 10-10 10a9.954 9.954 0 0 1-5.03-1.355L2.004 22zM8.391 7.308c.134-.01.269-.01.403-.004.054.004.108.01.162.016.159.018.334.115.393.249.298.676.588 1.357.868 2.04.062.152.025.347-.093.537a4.38 4.38 0 0 1-.263.372c-.113.145-.356.411-.356.411s-.099.118-.061.265c.014.056.06.137.102.205l.059.095c.256.427.6.86 1.02 1.268.12.116.237.235.363.346.468.413.998.75 1.57 1l.005.002c.085.037.128.057.252.11.062.026.126.049.191.066a.35.35 0 0 0 .367-.13c.724-.877.79-.934.796-.934v.002a.482.482 0 0 1 .378-.127c.06.004.121.015.177.04.531.243 1.4.622 1.4.622l.582.261c.098.047.187.158.19.265.004.067.01.175-.013.373-.032.259-.11.57-.188.733a1.155 1.155 0 0 1-.21.302 2.378 2.378 0 0 1-.33.288 3.71 3.71 0 0 1-.125.09 5.024 5.024 0 0 1-.383.22 1.99 1.99 0 0 1-.833.23c-.185.01-.37.024-.556.014-.008 0-.568-.087-.568-.087a9.448 9.448 0 0 1-3.84-2.046c-.226-.199-.435-.413-.649-.626-.89-.885-1.562-1.84-1.97-2.742A3.47 3.47 0 0 1 6.9 9.62a2.729 2.729 0 0 1 .564-1.68c.073-.094.142-.192.261-.305.127-.12.207-.184.294-.228a.961.961 0 0 1 .371-.1z" /></svg>
            </div>
            <div className='contact-icon'>
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24" width="24" height="24"><path fill="none" d="M0 0h24v24H0z" /><path d="M7.253 18.494l.724.423A7.953 7.953 0 0 0 12 20a8 8 0 1 0-8-8c0 1.436.377 2.813 1.084 4.024l.422.724-.653 2.401 2.4-.655zM2.004 22l1.352-4.968A9.954 9.954 0 0 1 2 12C2 6.477 6.477 2 12 2s10 4.477 10 10-4.477 10-10 10a9.954 9.954 0 0 1-5.03-1.355L2.004 22zM8.391 7.308c.134-.01.269-.01.403-.004.054.004.108.01.162.016.159.018.334.115.393.249.298.676.588 1.357.868 2.04.062.152.025.347-.093.537a4.38 4.38 0 0 1-.263.372c-.113.145-.356.411-.356.411s-.099.118-.061.265c.014.056.06.137.102.205l.059.095c.256.427.6.86 1.02 1.268.12.116.237.235.363.346.468.413.998.75 1.57 1l.005.002c.085.037.128.057.252.11.062.026.126.049.191.066a.35.35 0 0 0 .367-.13c.724-.877.79-.934.796-.934v.002a.482.482 0 0 1 .378-.127c.06.004.121.015.177.04.531.243 1.4.622 1.4.622l.582.261c.098.047.187.158.19.265.004.067.01.175-.013.373-.032.259-.11.57-.188.733a1.155 1.155 0 0 1-.21.302 2.378 2.378 0 0 1-.33.288 3.71 3.71 0 0 1-.125.09 5.024 5.024 0 0 1-.383.22 1.99 1.99 0 0 1-.833.23c-.185.01-.37.024-.556.014-.008 0-.568-.087-.568-.087a9.448 9.448 0 0 1-3.84-2.046c-.226-.199-.435-.413-.649-.626-.89-.885-1.562-1.84-1.97-2.742A3.47 3.47 0 0 1 6.9 9.62a2.729 2.729 0 0 1 .564-1.68c.073-.094.142-.192.261-.305.127-.12.207-.184.294-.228a.961.961 0 0 1 .371-.1z" /></svg>
            </div>
          </div>
        </div>
        <div className='footer_item_2'>
          <p>
            Полезное
          </p>
          <ul>
            <li>
              <a href="#">
                Услуги
              </a>
            </li>
            <li>
              <a href="#">
                Цены
              </a>
            </li>
            <li>
              <a href="#">
                Отзывы
              </a>
            </li>
            <li>
              <a href="#">
                Контакты
              </a>
            </li>
            <li>
              <a href="#">
                Вакансии
              </a>
            </li>
            <li>
              <a href="#">
                Соглашение о персональных
              </a>
            </li>
            <li>
              <a href="#">
                Условия использования
              </a>
            </li>
          </ul>
        </div>
        <div className='footer_item_3'>
        <p>
        Полезное
          </p>
          <ul>
            <li>
              <a href="#">
              Как работает наш сервис
              </a>
            </li>
            <li>
              <a href="#">
              Как покупать с оператором
              </a>
            </li>
            <li>
              <a href="#">
              Ответы на частые вопросы
              </a>
            </li>
            <li>
              <a href="#">
              Популярные магазины
              </a>
            </li>
            <li>
              <a href="#">
             Черный список магазинов
              </a>
            </li>
            <li>
              <a href="#">
              Актуальные распродажи
              </a>
            </li>
          </ul>
        </div>
        <div className='footer_item_4'>
        <p>
        Спецпроекты
          </p>
          <ul>
            <li>
              <a href="#">
              50% на первую доставку
              </a>
            </li>
            <li>
              <a href="#">
              Скидки для постоянных клиентов
              </a>
            </li>
            <li>
              <a href="#">
             Реферальная программа
              </a>
            </li>
            <li>
              <a href="#">
              Кэшбек Mr. Rebates и Rakuten
              </a>
            </li>
            <li>
              <a href="#">
              Stop Fraud
              </a>
            </li>
          </ul>
        </div>
      </footer>
    </div>

  );
}

export default App;
